const channels = {

    Public: {
        tax: '', // روم الضريبة التلقائية
        sugg: '', // روم الأقتراحات
        feedback: '', // روم الاراء
        post: '',// روم المنشورات المميزة
        gift: '',// روم اعلانات الهداية
        Warns: '',// روم تحذيرات البائعين
        ads: '',// روم الاعلانات العادية
        adscategor: '',// كاتيكوري الاعلانات
        FirstCat:'',// اول كاتيكوري للاعلانات الي تكون اول شي
        privateSCategory: '',// كاتيكوري الرومات الخاصة
        OpenCloseRoom:'روم_حالة_رومات_البيع',
        applyinfo: '',//ايدي روم الي تنرسل فيه التقديمات و قبول ورفض
    },

    Orders: {
        tasmin: '', // روم طلب التصميم
        program: '', // روم طلب البرمجيات
        mntj: '', // روم طلب المنتجات
    },

    Ticket: {
        
        SupportCategory: '',// ايدي كاتيكوري تكتات الدعم الفني
        ReportCategory: '',//ايدي كاتيكوري تكتات الشكاوي
    },
    
    Log: { // لوق بيع الرتب , المنشورات المميزة , الاعلانات , الرومات الخاصة
        RolesLog: '',
        PostLog: '',
        AdsLog: '',
        PrivateSLog: '',
        TicketLog: '',
    },

    AutoLine: [ //رومات الخط التلقائي عدا رومات البيع
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
    ],

    ShopRooms: [ // ايدي رومات البيع
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
        '',
    ],

};

module.exports = channels;