const roles = {

    sellerRole: 'رتبة_الي_تتمنشن_من_يصير_طلب_جديد',

    Public: {
        verifyrole: 'رتبة_العضو_الموثق',
    },

    Admins: {
        Maqbol: 'رتبة_الي_تنعطي_لينقبلون',
        DiscordStaff: 'رتبة_الي_تشوف_تكتات',
        DiscordLeader: 'رتبة_الي_تستعمل_اوامر_البوت',
    },

    price: { //الاسعار بدون الضريبة
        'Momo S': '', //رتب بيع
        'Pro S': '', //رتب بيع
        'Apex S': '', //رتب بيع
        'Titan S': '', //رتب بيع
        'Vanguard S':'', //رتب بيع
        'Phoenix S': '', //رتب بيع
        'Tech Smith S': '', //رتب بيع
        'Programing': '', //رتب بيع
        'Designs': '', //رتب بيع

        'here': '', //منشور مميز
        'everyone': '', //منشور مميز

        'بدون منشن': '', //اعلان
        'منشن هير': '', //اعلان
        'منشن ايفري ون': '', //اعلان
        'بروم الهداية': '', //اعلان
        'روم خاص مع قيف اوي':'', //اعلان
        'اول روم':'', //اعلان

        '7d': '', //روم خاص
        'renew7d': '',//سعر تجديد روم خاص
    },
    roleid: { // ايديات الرتب
        'Momo S': '',
        'Pro S': '',
        'Apex S': '',
        'Titan S': '',
        'Vanguard S': '',
        'Phoenix S': '',
        'Tech Smith S': '',
        'Programing': '',
        'Designs': '',
        'PrivateS': '',// روم خاص
    },

    WarnsRole: { //ايديات رتب التحذيرات
        Warn25: "",
        Warn50: "",
        Warn100: "",
    },

    RolesSellers: [ //ايديات رتب البيع
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
    ]
}

module.exports = roles;