const settings = {
    Token: 'توكن_البوت',
    prefix: '$',// البرفكس
    EmbedColor: '#101949',//لون الامبد الي يكون يسار الامبد لازم يكون هيكس
    BankID: 'ايدي_البنك',
    ClientId: 'ايدي_البوت',
    
    ServerInfo: {
        owner: 'ايدي_اونر_السيرفر',
        serverID: 'ايدي_سيرفرك',
        Probot: 'ايدي_البروبوت_حقك',
    },
    
    Pic: {
        Line: 'الخط',
        Orders: 'صورة_مكتوب_عليها_الطلبات',
        Prove: 'صورة_مكتوب_عليها_اثبت_نفسك',
        Ticket: 'صورة_مكتوب_عليها_التذكرة',
        Info: 'صورة_مكتوب_عليها_المعلومات',
        tashfer: 'صورة_مكتوب_عليها_التشفير',
        Rules: 'صورة_مكتوب_عليها_القوانين',
    }

}

module.exports = settings;